# Варинат 1

winter = [12, 1, 2]
spring = [3, 4, 5]
summer = [6, 7, 8]

month = int(input("Введите номер месяца: "))
while month > 12:
    month = int(input("Такого месяца не существует. Введите число от 1 до 12,"
                      "соответствующее номеру месяца: "))

if month in winter:
    print(f"{month}-й месяц относится к зиме.")
elif month in spring:
    print(f"{month}-й месяц относится к весне.")
elif month in summer:
    print(f"{month}-й месяц относится к лету.")
else:
    print(f"{month}-й месяц относится к осени.")

# Вариант 2

seasons_list = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима']

month = int(input("Введите номер месяца: "))
while month > 12:
    month = int(input("Такого месяца не существует. Введите число от 1 до 12,"
                      "соответствующее номеру месяца: "))

print(f"{month}-й месяц соответствует времени года '{seasons_list[month - 1]}'.")

# Вариант 3

seasons_dictionary = {1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето',
                      7: 'лето', 8: 'лето', 9: 'осень', 10: 'осень', 11: 'осень', 12: 'зима'}

month = int(input("Введите номер месяца: "))
while month > 12:
    month = int(input("Такого месяца не существует. Введите число от 1 до 12,"
                      "соответствующее номеру месяца: "))

print(f"{month}-й месяц соответствует времени года '{seasons_dictionary[month]}'.")
